{
    "KD Kanwar Reviews": [
        {
            "author_title": "grvndr",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocI-CsRyTqIz-NY8bBfrKFKdxwcMPDXg58IGVAwd6TIQZkhrYgU=s120-c-rp-mo-br100",
            "author_reviews_count": 8,
            "Text": "I had the pleasure of working with Kanwardeep Kanwar, a Mortgage Specialist at the BMO Shoppers World branch. His professionalism and assistance were truly remarkable. Kanwardeep recently helped me secure a mortgage without a single hassle or issue. His expertise and dedication to his work were evident throughout the entire process. I am so impressed with his services that I wholeheartedly recommend him to all my family and friends. Kanwardeep's commitment to ensuring a smooth and stress-free mortgage experience is truly commendable, and I couldn't be more satisfied with the results.",
            "Rating": 5,
            "Time": "10/23/2023 00:06:32"
        },
        {
            "author_title": "Dinesh Babu",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUzPm9BU3QRs6nl0kcufC2rAVPq0GXIdAuYqnRCfc1RRai7-hN5=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "I recently had the pleasure of working with Kanwardeep. From the moment I met him he made sure he answers all my questions promptly and got the best available rate and term.\nHe demonstrated professionalism, patience, and a genuine commitment to helping me find the best mortgage solution.\nWhat sets him apart is his experience and knowledge which makes the entire mortgage process smooth and hassle-free from the start till closing.\nI would highly recommend Kanwardeep to anyone who need mortgage specialist. If I have to go with Kanwardeep again, I won't hesitate for a second.",
            "Rating": 5,
            "Time": "10/19/2023 22:17:54"
        },
        {
            "author_title": "Francis Johnson",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKxsCvITOmLL2IxYkamL4JXudn54nwXoq4B3qLZrGzZdpYl7w=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "Kanwardeep was a joy to work with on my recent transaction. He was very patient, taking his time to explain every phase of the transaction and he made sure the deal went through without any hitches. KD is a super guy, highly recommend!!",
            "Rating": 5,
            "Time": "10/19/2023 18:22:22"
        },
        {
            "author_title": "Sunil Kumar",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUhQBsgxkqn5CHfcVFL3tJebGDZyZc_Sbbmh1CsQviM-C9sL6oW=s120-c-rp-mo-br100",
            "author_reviews_count": 7,
            "Text": "Mr. KD is highly professional in his work. He is quite responsive and provides valuable inputs on the situation. He explains in detailed, works hard, honest and ethical. He responds to our questions immediately. He is very dependable and would go with him each time I look for mortgage here in Canada. I wish you all the success. I would strongly recommend him to anyone seeking good mortgage deals. The best thing about KD is he listens and has a lot of patience.",
            "Rating": 5,
            "Time": "10/05/2023 17:28:07"
        },
        {
            "author_title": "ANSHUMAAN BIR",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKFDSqSIhg_iDy5IV6xxBQSfBe_A8Km2Mgmuo9EKrVlbFFVaA=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "As a Realtor, I have dealt with lot of Mortgage agents both for myself and my clients but when I came across and talked to Kanwardeep the best thing I found which other agents lack is proper communication skills. I found Kanwardeep very soft spoken and detail oriented. The level of patience in explaining the procedure and discussing the options that can be considered is remarkable and outstanding. I truly appreciate his services and would definitely recommend him to anyone looking  for a mortgage specialist. Great job Kanwardeep and thank you.",
            "Rating": 5,
            "Time": "10/05/2023 15:52:18"
        },
        {
            "author_title": "Shivender Bedi",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXWgdnrnw0HtAGxBD-_7FckNyb-HS_YqmpYakX1PnJaTaRtF2jy=s120-c-rp-mo-br100",
            "author_reviews_count": 9,
            "Text": "A very knowledgeable professional with customer first approach.",
            "Rating": 5,
            "Time": "09/21/2023 00:19:52"
        },
        {
            "author_title": "s Patel",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLwvmUjKMY8KtKAqEI4LW3U8sLGtLqnyVj4W9A2BT95TAJHkw=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "We had very good experience with KD as mortgage specialist. He gave excellent advise about mortgage as well insurance as an advisor. He is very professional & gentle person to deal with  it. His expertise & good knowledge about market & know how to deal with approved mortgage application. I would suggest his name  to any one  who wants smooth, hassle-free mortgage application.",
            "Rating": 5,
            "Time": "08/31/2023 21:32:30"
        },
        {
            "author_title": "Prakash Patel",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLpG9Myvby8pSe_w191whLcXYwJjezKXeoaZ7G10PJKbjF9NIk=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Had a fantastic experience with KD, our mortgage specialist. Extremely professional, knowledgeable about the market, and highly responsive. Highly recommend. We are very grateful and happy with his service",
            "Rating": 5,
            "Time": "08/30/2023 18:14:39"
        },
        {
            "author_title": "Vijay Bangalore",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVxomA1X5yRIodVKZ8ynkRrKONvd4U7IkGVgpHXMyLyMd29dAFW=s120-c-rp-mo-ba4-br100",
            "author_reviews_count": 42,
            "Text": "We had very good experience working with KD as our mortgage specialist. Very professional and gentle person to deal with. He has a very good knowledge about the market and knows very well what gets approved before putting an application. Very approachable and kind enough to answer all your queries and concerns. He responds immediately for all the requests. Highly recommend Kanwar for your mortgage requirements.",
            "Rating": 5,
            "Time": "08/07/2023 12:27:41"
        },
        {
            "author_title": "Arshdeep Singh",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLozpmarN-K_hBbNloXGPU6ayns52rm2Bw9rNrJxnpBIWpLGw=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 35,
            "Text": "Kanwardeep is very talented mortgage specialist and provide clients with clarity to great extent. He is good listener, answers all queries and guide clients through his experience. He is calm and professional. I would recommend him to anyone.",
            "Rating": 5,
            "Time": "08/03/2023 16:19:26"
        },
        {
            "author_title": "VINITA tanwar",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocL819cOJEKoIPpsZ4Yas23TdmbT-EXkne009MZoW6IqAGncLw=s120-c-rp-mo-br100",
            "author_reviews_count": 6,
            "Text": "Very professional, Soft spoken helpful",
            "Rating": 5,
            "Time": "06/27/2023 20:33:47"
        },
        {
            "author_title": "Thejasree Gutha",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLzKe-UcxPJaaR0_SIF3KtOc0S0iJR12HeGrJrWaBdG-rFPd9s=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "We recently had the pleasure of working with Kanwardeep as our BMO Mortgage Specialist, and I can confidently say that he exceeded all our expectations. One aspect that truly impressed us was Kanwardeep's attention to detail. He meticulously reviewed all the necessary paperwork, leaving no room for errors or oversights. This level of thoroughness gave us confidence in the accuracy and completeness of our mortgage application. Kanwardeep's expertise and diligence were instrumental in securing the best possible mortgage terms for us.",
            "Rating": 5,
            "Time": "06/15/2023 02:32:58"
        },
        {
            "author_title": "Ranjith Goolla",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVLQLLi9UKzgnDAp0vs_pC3gVPDf46tdLIhh329mZGnEVtVd1yiHg=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Working with Kanwardeep as my Mortgage Specialist was an exceptional experience from start to finish. His expertise and dedication made the entire mortgage process smooth and hassle-free. From our initial consultation to the final closing, Kanwardeep demonstrated professionalism, patience, and a genuine commitment to helping me find the best mortgage solution.\nKanwardeep's knowledge of the mortgage industry and his ability to explain complex concepts in a simple and clear manner impressed me greatly.  Throughout the process, he remained readily available to address any questions or concerns I had, promptly responding to my emails and calls.\nWhat sets Kanwardeep apart is his unwavering commitment to his clients' satisfaction. He went above and beyond to ensure that I secured a mortgage that aligned with my needs . He diligently explored various options, explaining the pros and cons of each, and provided personalized recommendations tailored to my situation. I would highly recommend Kanwardeep Kanwar to anyone in need of a knowledgeable and trustworthy Mortgage Specialist.",
            "Rating": 5,
            "Time": "06/15/2023 02:24:59"
        },
        {
            "author_title": "Shivam Chandel",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVMH8bll5R_gs9W7pvfLOBZ_5UfwNmPRJTZD6u-4wt---G_hvO5=s120-c-rp-mo-br100",
            "author_reviews_count": 10,
            "Text": "Recently got the mortgage approved at Bmo by Kanwar ji , he guided and supported through the whole process and gave genuine advice . Thank you for assisting in our first home mortgage!!",
            "Rating": 5,
            "Time": "05/27/2023 02:54:40"
        },
        {
            "author_title": "Ashok Kolla",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLH-RdloeVkWimDX7nuipnRQbhx_JT2xjsUCfWO6Sn-FWBd1Q=s120-c-rp-mo-br100",
            "author_reviews_count": 8,
            "Text": "Mr Kanwar helped me right throughout the mortgage process step by step. He has very good knowledge and understanding of my mortgage needs. His approach to problem solving and advice during my mortgage process are commendable. He has excellent interpersonal skills and is very approachable. I recommend his services 100%.",
            "Rating": 5,
            "Time": "05/25/2023 12:28:39"
        },
        {
            "author_title": "Patrick Onyia",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocK6DpTcn6wNwQ5-dvSQFN12ruyMm2qX8-Vo1XH2BFezdTn6EA=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "My experience dealing with Kanwardeep has been exceptional. He was patient, resourceful and very professional in providing advise that helped me make informed decision when purchasing my house. He goes the extra mile to ensure customer satisfaction. I will definitely do business with him again and I will refer my friends and family too.",
            "Rating": 5,
            "Time": "05/19/2023 21:36:07"
        },
        {
            "author_title": "Reiki Grandmaster",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLs6ltqrA0QM1TGOhGxjNQIjB3oYF9qO3atDkzzNmuYnnmCyQ=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Excellent service.",
            "Rating": 5,
            "Time": "05/18/2023 13:07:33"
        },
        {
            "author_title": "manish goyal",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVpu2HLxe-EHvSYVjoVSS45FRXFNY-QNU4KzKCRchiQhTqqQ1hZ=s120-c-rp-mo-br100",
            "author_reviews_count": 11,
            "Text": "I recently had the pleasure of working with a mortgage adviser, KD (Kanwardeep Kanwar), and I have to say that the service and personal attention he provided was truly exceptional. From the moment we met with him, we knew that we were in good hands.\n\nKD's knowledge of the local and national market is second to none and he was committed to finding us the best possible rate for our dream home. As first-time home buyers, we were new to the process, and KD was there for us every step of the way. He made sure we were informed and educated on each step of the buying process, which really put our minds at ease.\n\nOne of the things I appreciated most about KD was his responsiveness. He was always available to answer any questions we had, and his support and guidance were invaluable throughout the entire process.\n\nOverall, I am incredibly grateful that we chose KD's services and would highly recommend him to anyone in the market for a mortgage adviser. He truly goes above and beyond for his clients and we couldn't be happier with the experience we had working with him.",
            "Rating": 5,
            "Time": "05/12/2023 18:45:31"
        },
        {
            "author_title": "Ram Eerpina",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVKbjVST8WVCGJri0NGdGWqP6s5jNJ722lZy2GiuOHpeeQsR7M=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "I had a great pleasure to work with KD to apply for a mortgage. Unlike many others he didn’t make us to run around to get various documents. He was very meticulous and detail oriented and willing to listen to his clients. After I submitted my documents he was able to secure the mortgage in less than week which rarely happens in the mortgage application process. Even after closing he followed up to check if the closing went smoothly and if we need any more help. Following through even after the work is completed is something most people won’t do. If I have to go with KD I won’t hesitate for a second.",
            "Rating": 5,
            "Time": "04/27/2023 19:37:30"
        },
        {
            "author_title": "Kalyan Krothapalli",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUOepFne-mr9_S9ScW2nRfycTRfVFXoRDRdB2oWI2JTCata5WqB=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 14,
            "Text": "I recently had the pleasure of working with Mr. KD to secure a mortgage for my new home, who gave exceptional attention to detail, which was especially important during the mortgage approval process. He was able to anticipate any potential issues and took proactive steps to ensure that my mortgage was approved smoothly and efficiently. Overall, I would highly recommend Mr. KD to anyone in need of a mortgage. Thank you, Mr. KD, for making the mortgage process so smooth and stress-free!",
            "Rating": 5,
            "Time": "04/09/2023 03:23:07"
        },
        {
            "author_title": "Saketh Kumar",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUGLkLGQpLT9Gw1eP2N3pxZ0GIz73BMBNayF8z7g3fCFCJNj8mw=s120-c-rp-mo-br100",
            "author_reviews_count": 8,
            "Text": "KD helped me with my mortgage and he was a pleasure to work with. He made the entire process simple and easy to understand by explaining everything clearly. I highly recommend him for anyone looking for a mortgage",
            "Rating": 5,
            "Time": "04/07/2023 18:39:10"
        },
        {
            "author_title": "Manik Sharma",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWJLz2iz5NY68rbGU8tfOOVNPjQOW_hbpF5vDCmC7ZAl_wyQLM=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 19,
            "Text": "Great experience with Mr. KD. Softly spoken, immense knowledge and experience, guides through every part of mortgage. Anyone looking for any type of mortgage must consult with Mr. KD.",
            "Rating": 5,
            "Time": "03/31/2023 22:21:56"
        },
        {
            "author_title": "Mantek Bhogal",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXfeJXRoiq3NWeZoPpAOkOCTwMZkqmKASzvnzLKTgphTCX93DI=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 10,
            "Text": "Very professional and genuine personal who explains everything with full transparency. Highly recommended for all mortgage needs.",
            "Rating": 5,
            "Time": "03/28/2023 12:36:24"
        },
        {
            "author_title": "adeela karim",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKfdjO_W_8b0KCH8ezJ3h_Ut6jayeB1IQTbvSyVJ0PUOtjZtA=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Great mortgage specialist. I've been to a few and Kanwardeep has been the most honest and clear about every detail and question you may have. Highly recommended!",
            "Rating": 5,
            "Time": "03/09/2023 16:21:58"
        },
        {
            "author_title": "Sathiskumar Girikrishnan",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJcF36f57q3D3OClC78nP7qzOmcLyTOSS33h9r8pBSYUzhgZ_Y=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 14,
            "Text": "We had a great experience with KD. He was patient enough to address each and every question that we had through the whole process. Highly recommended!\n\nThanks for your service.",
            "Rating": 5,
            "Time": "03/04/2023 21:20:57"
        },
        {
            "author_title": "ajay",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWi5r3nbaP89IsQTe6XrkxRxJ1cNX5xK35OxZiYhWU0zR09rMFm=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "KD Kunwar has helped and guided throughout my home buying journey. He explained everything in details and answers all queries patiently. KD availability and time to response is at par, he is a genuine person and I recommend his services.",
            "Rating": 5,
            "Time": "03/01/2023 18:51:00"
        },
        {
            "author_title": "Venkatesh Muddana",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLRGDPblJZvTp7Pvnvvn2gZA1jDHb_0OHAva77CmJgyD0zKvQ=s120-c-rp-mo-br100",
            "author_reviews_count": 10,
            "Text": "Very good mortgage specialist",
            "Rating": 5,
            "Time": "02/18/2023 07:05:09"
        },
        {
            "author_title": "avinash megharaj",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJXOCxvFNRmgTfeN2Bvz_Q9ZhKgIz30uYLf2QRZ1BKdQocl3Q=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "Very professional and helpful. Would love to work again in future.",
            "Rating": 5,
            "Time": "02/15/2023 22:11:32"
        },
        {
            "author_title": "Shreyas",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJaUTE8rkKSYXnCko3zwZtlvxo2GP5t2mXMQ1y5K8vfzueeOw=s120-c-rp-mo-br100",
            "author_reviews_count": 8,
            "Text": "Thank you Kanwardeep for processing the loan application in such a quick timespan. Great effort and very pro-active follow up with the clients. Would really appreciate your hard work and commitment in the work.",
            "Rating": 5,
            "Time": "02/01/2023 15:52:13"
        },
        {
            "author_title": "Abhishek Mitra",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLezGt08mbDBqd9nfzNv-UNT_LINUMn6XFB9G_y945UG4AhoA=s120-c-rp-mo-br100",
            "author_reviews_count": 18,
            "Text": "We had a phenomenal experience working with KD sir while purchasing our first home. He was kind and patient in listening to our needs and providing the best advice and service. He even saved us money when we were making our offer in this rather difficult housing market. I highly recommend his services for mortgage needs but he is also a wonderful person to speak with for any home buying needs in general. Thanks to his wisdom we were able to secure our first home without any hassles and with minimum effort.",
            "Rating": 5,
            "Time": "01/06/2023 19:33:51"
        },
        {
            "author_title": "tarvinder kaur",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjU25ZlJFv93-S9V-pf4qCvbx_VlRqvclm6SysSO8Ur9HwaSfsoA=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Was blessed to work with Kanwardeep, He is a great professional in mortgage industry who always works in best interest of his customers. His knowledge and insights were really helpful in getting us the best suited mortgage solution.\n\nHighly recommended other potential buyers to connect with him for not only great customer experience but also to get the apt mortgage solution. Thanks again Kanwardeep for all your help and support.",
            "Rating": 5,
            "Time": "12/22/2022 13:50:06"
        },
        {
            "author_title": "Dharampaul Saini",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXDN_Bq4ct32t6DTmNN4SB_zAUgIJ6UtUQTN7jedg4AUkYw_Co=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Very humble,experienced and knowledge able mortgage specialist",
            "Rating": 5,
            "Time": "12/06/2022 20:21:23"
        },
        {
            "author_title": "Raj Ubhi",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJuUUySMNQLYWovP9fGvNX_ixiV3Axn3ImNninIE0ayUmTFQg=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "I had an amazing experience applying for a home mortgage with Mr.Kanwar. He is very transparent, explains different solutions in great detail, and is happy to offer support any time of the day. I highly recommend his services for all your financial needs!",
            "Rating": 5,
            "Time": "11/14/2022 22:39:24"
        },
        {
            "author_title": "AVTAR KAMBOJ",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocITZLZzfXlOYW5qiBZJZPjoMHWCUsFnoQRKa8beFx2FE2QtyA=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "KD is very kind, honest and helpful Professional. He is ethically very sound. He cares more about his professional relationship than money.",
            "Rating": 5,
            "Time": "11/13/2022 09:58:38"
        },
        {
            "author_title": "Er Deep",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjX28et9gWJLSD49BjYjz5O-GN4bmr88EIKf4SDaptk3iPm6vY2z=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 13,
            "Text": "Always,  Thankful to Kanwardeep, He is really professional in his field.\nHe was very confident about out mortgage approval and I got our approval in 4 days with good interest rate and he supported me till closing date.\n\nHighly recommended to other get experience of his professional mortgage services. Thanks again and best wishes for his future and stay healthy.",
            "Rating": 5,
            "Time": "11/11/2022 02:22:41"
        },
        {
            "author_title": "Janardhan Reddy Peram",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJrYGPOP90ouffakRoRgBynxPENXIouUasHE-xTUQKolm2x3g=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Kanwardeep Ji is Very Professional and tracks the Mortgage Application Process effectively till closure and I would highly recommend his service for anyone looking for home mortgage.",
            "Rating": 5,
            "Time": "11/06/2022 13:49:14"
        },
        {
            "author_title": "krishna kumar",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXTqQQs3q6D9LbEzKzCFr9As4HI2ENyqL_Z2qNG7MPu7XGmi4MU7w=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "Kanwardeep was very professional and honest person. He took his time to explain everything. Thanks Kanwar give me a right advice at right time.If you're looking for someone to help you who is experienced and knowledgeable, I highly recommend him for all your mortgage needs!",
            "Rating": 5,
            "Time": "10/31/2022 23:30:47"
        },
        {
            "author_title": "Bini Jacob",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVBEkg3Rhou-D2jHU0qx-G_jf_yL9Hvg_-Myqkqoe-CdVi9r-JS=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 2,
            "Text": "Very professional and gentle person to deal with. He has a very good knowledge about the market. Approachable person for all your queries and concerns. He responds immediately for all the requests. We had very good experience  working with him as our mortgage specialist. Definitely recommend KD.",
            "Rating": 5,
            "Time": "10/11/2022 00:57:32"
        },
        {
            "author_title": "Owais Memo",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIdalmkN3areQRvR_mv_iivS11gBxaT_EWcxsIHY69wx7Dz4g=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Kamwardeep Kanwar took the time to explain the mortgage process and was responsive, supportive, and made us feel comfortable throughout. I highly recommend him for all mortgage inquiries and questions. Will definitely be referring him to friends and family.",
            "Rating": 5,
            "Time": "09/13/2022 17:39:00"
        },
        {
            "author_title": "Rajat Sarkar",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWNYrvDYIO8L8-Www7Sv5pvqEfg20Y3CXRB-RE61HyESpZhiWtTyw=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "The service and personal attention we received from KD (Kanwardeep Kanwar)was exceptional and beyond what we were expecting! His knowledge of the local and national market and his commitment in finding us the best rate helped us in our search for our dream home. As first time home buyers everything was new to us and the most important thing we wanted was someone we could trust. He was there for us every step of the way.\nHe is very responsive, supportive and helpful. He makes me educated on the each steps of buying process.\n\nI'm glad we chose his services and would recommend KD to anyone buying a home.",
            "Rating": 5,
            "Time": "09/07/2022 12:02:04"
        },
        {
            "author_title": "Odilia Strazzanti",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIY2krFltcdgs4sMH6NxiJrMox8PZY5lMOlY9zKqCDXsz_r0A=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 28,
            "Text": "We had an excellent experience with KD.\nKD is skilled and efficient with a wealth of knowledge.  He is very competent, sincere and diligent.\nWe highly recommend KD for your financial needs.\nWe thank you for your assistance and hard work.",
            "Rating": 5,
            "Time": "09/04/2022 15:59:03"
        },
        {
            "author_title": "Prasanna Deshpande",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXVWMJAM9AhLW3UDtOdIpothK8SNt4MHZcm5G_PNHVzK4vycy77lA=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 28,
            "Text": "KD is a wonderful Mortgage Specialist. He indeed is a “specialist“. He took his time in explaining things until I understood and guided me so that I can take informed decisions in mortgage approval for house purchase. Even in these turbulent times, our closing went pretty smooth because of all homework he did. Definitely recommending to everyone!",
            "Rating": 5,
            "Time": "09/02/2022 20:17:56"
        },
        {
            "author_title": "ramesh reddy",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIyWp_LvLdbqsR6oYZln02U168cPNWEt5R0jOwr1-w9D_yWmw=s120-c-rp-mo-br100",
            "author_reviews_count": 7,
            "Text": "I recently worked with Kanwar ji for my mortgage. He is very gentle , patient and helped us with all details. Very much approachable and I would strongly recommend him for your financial needs.",
            "Rating": 5,
            "Time": "08/16/2022 17:04:30"
        },
        {
            "author_title": "Deepika Panwar",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjV9VsKulGj6imvOAiQ4gpqfwz-CWmtjBrDQz4KvDHLZWDGkjZLB=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 16,
            "Text": "Kanwardeep Ji is an amazing agent! Right from the day we got in touch with him till the day we closed (and even after) we received the best support and guidance from him through out the transaction. Being a first time home buyer it was not easy for us to navigate through the whole process but he made it much better. He not only answered our queries related to the mortgage but also general purchase related questions.\n\nHe is really experienced in his field, helpful and a warm person to meet. I'll surely recommend him to everyone, whether a first time buyers or investors.",
            "Rating": 5,
            "Time": "07/22/2022 20:12:32"
        },
        {
            "author_title": "Rohan Advani",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKaf7Ag5DRxxNN-PN2CJGR_pWL-gxijtDxIViIlooOxfucX3w=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 18,
            "Text": "Kanwar was very helpful and knowledgeable about the mortgage rules.\nI was rate shopping and he was able to get me the best rate in a challenging market. Would highly recommend Kanwar to everyone",
            "Rating": 5,
            "Time": "07/07/2022 02:41:25"
        },
        {
            "author_title": "Aman SK",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocK9Wy1fXFduWaclmcZSVvJtI8u8ZTpQ7LQt5_a21iB1YOQLCg=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 73,
            "Text": "KD is an unbelievable Mortgage Specialist.  I was with TD for 30 years… I am so happy I met KD as I had no idea there were other better options out there.  KD is the hardest working bank professional I’ve met.  A year ago we met and I always asked him for advice and even though I wasn’t switching to BMO he helped me; so now I’ve switched over to BMO.  KD is very patient, calm, and very very experienced.",
            "Rating": 5,
            "Time": "06/09/2022 01:51:46"
        },
        {
            "author_title": "Rick Patel",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXfzn4aTMH6fzwEMtD5YZfASIkiFMTlesnpDInH5n_EIhfhV2T4=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "Kanwardeep is very knowledgeable of mortgage market/products and very helpful throughout the entire mortgage process.\nI strongly recommend him for Mortgage needs. I had an amazing experience of working with him. Thank you KD for all the support!!!",
            "Rating": 5,
            "Time": "06/03/2022 01:00:32"
        },
        {
            "author_title": "Divjot Mehton",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXvzNz7_u5LRoj-XJx5xj6o_HnoReGkqo_8iO6PfVC3dj1dxseo=s120-c-rp-mo-br100",
            "author_reviews_count": 11,
            "Text": "Kanwardeep is an amazing Mortgage Specialist with BMO and helped us out extremely well. Very well spoken and knowledgable. We were very happy to work with him and the process was made very smooth. I would recommend him for all your Mortgage needs. Thank you!",
            "Rating": 5,
            "Time": "05/26/2022 01:22:17"
        },
        {
            "author_title": "Lalit Thakar",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjV4MevUxd9B-p1MxaMsuyfCHWgx3GfPR3R4DeyFCadfhNNa7ceb=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "KD sir is excellent. Good knowledge. Thank you for your support and guidance",
            "Rating": 5,
            "Time": "05/11/2022 18:50:43"
        },
        {
            "author_title": "Abhinav Verma",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVVkhnuq2B2biQYES0PPJcEfku1pAci2HgYHDh5UTwwphZB0miH=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 17,
            "Text": "Thanks KD sir for helping and guiding us throughout our Mortgage process. Really you made it so simple and easy.\nI highly recommend anyone looking for Mortgage guidance, please connect with Mr. Kanwardeep Kanwar from BMO.",
            "Rating": 5,
            "Time": "05/06/2022 23:58:40"
        },
        {
            "author_title": "Himanshu Shekhar",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWqDx6TqFyxv5rAbEu4gl5YJopP74OkGm2378yf0K1ixd2U_GDQ=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "I had an amazing experience of working with KD for our mortgage needs. He patiently heard our needs and helped us with his expertise in our mortgage solution. His opinion / suggestion helped us make well informed decision. I would definitely recommend his services. Hope to work with him again!",
            "Rating": 5,
            "Time": "04/27/2022 19:51:19"
        },
        {
            "author_title": "sharan prasad",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKYLuiSKf4VXRWFvJODKMWVXHmguILUa3UWhEuRgNc1p2Qg2Q=s120-c-rp-mo-br100",
            "author_reviews_count": 0,
            "Rating": 5,
            "Time": "04/26/2022 02:29:17"
        },
        {
            "author_title": "pav A",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocK6TzVLeswGg1RW9j-oq4X3XV6kpOTbKnacM8AdhYMKpjFdkKsn=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "Extremely thankful to have know Mr Kanwardeep. It is a pleasure always interacting with him. He was so accurate and precise with our mortgage. He has client interest as his priority and was always approachable and reachable. I would recommend him to anyone without a second thought.",
            "Rating": 5,
            "Time": "04/26/2022 02:07:17"
        },
        {
            "author_title": "mani hans",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWIawoks9jnGpN0A48fWtQ-NiCz-bdbtP5VA3yaeutvu7k9YFY=s120-c-rp-mo-br100",
            "author_reviews_count": 7,
            "Text": "I am really glad that me and my friend were able to meet a  knowledgeable, reliable mortgage professional  KD. He is  a very calm, soft spoken  individual who helped  us to get the mortgage within a tight timeline for our preconstruction condo. I would highly recommend his service for anyone looking for mortgage. Thank you Mr. KD! I greatly appreciate your assistance!",
            "Rating": 5,
            "Time": "04/19/2022 16:33:51"
        },
        {
            "author_title": "Israel Kota",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKZM8XG5qNIc-KtOMEuyjUD14zswEaiKWGtYbkyaRZOZJwCyA=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "I have had an Awesome and Excellent experience with Mr.Kanwardeep.\nMr.Kanwardeep is skilled and efficient banking professional with wealth of knowledge in Mortgage industry and Home Equity Line of Credit banking needs.\nKanwardeep is Competent with Diligent approach in processing, explaining, and providing guidance about mortgage needs.\nKanwardeep is Sincere in handling my mortgage and Home Equity Line of Credit applications, he has effectively processed my application in a timely manner.\nKanwardeep is Diligent in procuring required documentation so that me and my family is well protected.\nKanwardeep’s helping nature with honesty and integrity, timely communications, well mannered behavior with kind-heartedness impressed me and my wife, which led us to experience a friendly relationship, which is beyond the normal customer and banking professional relationship.\nI highly recommend Mr.Kanwardeep for your mortgage needs.\nMe and my wife sincerely THANK Mr.Kanwardeep for his help with my mortgage and Home Equity Line of Credit application processing with BMO.",
            "Rating": 5,
            "Time": "04/09/2022 03:20:55"
        },
        {
            "author_title": "R Sand",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUBw5j1wrRHWi-b8jaR2LewCpCdg3tqrfcJSndo3sOQqFStY5SL=s120-c-rp-mo-br100",
            "author_reviews_count": 11,
            "Rating": 5,
            "Time": "03/08/2022 15:26:50"
        },
        {
            "author_title": "Alana C",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjU2V1erLEvLdKAM5gXPcsSTEe8M0x7D3HaMSwJRamR0uRnv5bdW=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 26,
            "Text": "I was recommended to speak with Mr. Kanwardeep Kanwar, BMO for my baking needs from a friend who had used his services as her regular banker was away..She spoke so highly about Mr. Kanwar that I decided to call him ..Not only did he exceed my expectations, he called me every step of the way to let me know where he was in the progress and my next steps..I honestly don’t like to write reviews but he has been so amazing during this process I had to..If you want someone to listen to you, offer you the best advice for your situation and work hard and efficient then Mr. Kanwar is the person you want working for you and on your side.",
            "Rating": 5,
            "Time": "03/07/2022 21:35:57"
        },
        {
            "author_title": "Prabhjot Singh",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIYzAgo7lxapyJrVvMQ9uDQcFG5eb4IyGUo_j4A_Er6HT5gMw=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "KD was professional and competent in providing clear, simple, and timely financial guidance to help us gain greater visibility and control of our financial life.  He is always available to answer questions in a prompt manner. I would readily recommend him to my family and friends for their future mortgage needs. He got us the best mortgage rate for my property and set up everything for us.",
            "Rating": 5,
            "Time": "02/13/2022 02:51:17"
        },
        {
            "author_title": "Nitin Bhalla",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUsmVZdY0Lxcsb_TfkTCJMMr9BpWcTBhU3oGVo98wbwz4wK4HXLJA=s120-c-rp-mo-br100",
            "author_reviews_count": 11,
            "Text": "My experience of dealing with KD has been nothing but great. He is a good listener, and explains all stages involved in mortgage approval and was transparent all along. He was knowledgeable and understood BMO policies in and out. Where other brokers could not structure a deal well, KD worked his magic in less than 10 days and helped closed a deal on time.",
            "Rating": 5,
            "Time": "01/31/2022 16:33:46"
        },
        {
            "author_title": "Sadhana Dubey",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocL5_gj3M1LuI6v5HMthtcjY8insqWvVM9px3q3KF9WSSie2=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "KD is the best mortgage specialist in the area that you can find. He was very well spoken and helped us understand all the details about our mortgage. He’s a very kind person who takes his time to explain everything to the client and really takes care of them. You won’t be disappointed in his services if KD is your mortgage specialist. Me and my husband were very satisfied and content with his services and generosity. Thanks",
            "Rating": 5,
            "Time": "01/10/2022 00:01:36"
        },
        {
            "author_title": "Michael Sebastian",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVuqE5ZeU2qr8LThpyVgFiOeSzEWlRqc7a4Z1iYE3ICNI-ttWEfqQ=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 11,
            "Text": "If you are looking for a mortgage don't look any where other than Mr. Kanwar, you need not have to look at the clock or calendar to contact him he is available all the time to answer your queries. My closing day was little tight due to Christmas / New Year holidays but Kanwar has arranged everything  ahead of time working late in the night with the appraiser and closed the deal at the right time, thank you Kanwar for all your support.",
            "Rating": 5,
            "Time": "01/07/2022 14:22:27"
        },
        {
            "author_title": "Kiran Nookala Sai",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUrKZVmxd2NMRfaZW5xiUR-hW5yppADdRyfZrL5xKy_9cL26ls=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "We had the best experience with Mr. Kanwardeep. He was so patient in answering all our questions. We strongly recommend Mr. kanwardeep as mortgage advisor to anyone.",
            "Rating": 5,
            "Time": "12/17/2021 16:21:29"
        },
        {
            "author_title": "Ashutosh Srivastava",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLevSgI31e7LGBagTSIlrghywWeHrNZ3MndKFCAlga6j57vuA=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Excellent experience with KD, he made the entire process simple. Very patient to answer all queries, provides details and follow up  proactively to close all the formalities well ahead of the closing.  Thanks KD.",
            "Rating": 5,
            "Time": "12/16/2021 19:12:10"
        },
        {
            "author_title": "Pradyotsen Shukla",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWoqQ9dHKMGQE2FhNA8PlIKZNOJOKatrmx438ulwkyjWRPIOqSg=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "KD played significant role in fulfilling our financial needs. KD is highly professional mortgage specialist and advisor. I strongly recommend KD for any financial Assistance. Thanks",
            "Rating": 5,
            "Time": "12/14/2021 14:44:19"
        },
        {
            "author_title": "priyanka sharma",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLJGIPj6ukOZMb6lTccTx_P5TskhKHN80kaQVSCsLUQjDKpDA=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Kanwar is extremely professional, knowledgeable and pleasure to work with. He helped us in every step from planning to put in an offer for the property to approving our mortgage. He is always readily available to answer our phone calls, text and emails and thoroughly explains all the process and answers our questions.\nWe highly recommend his expertise! Thank you Kanwar for all your help and support!",
            "Rating": 5,
            "Time": "12/11/2021 23:53:12"
        },
        {
            "author_title": "Jagtar Boparai",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocI92QHkGYJdjA_uNRk4ssfznZaKlEFE9dps0wfuL8DbdqFkYw=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "Very good service,please keep it up. Thanks.",
            "Rating": 5,
            "Time": "12/08/2021 16:24:37"
        },
        {
            "author_title": "Jasminderjit Singh",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIKnKR06gmX6oWX_8JrLOfbEqWUmDhpR4xcM0zqHU43AUJkWg=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "He is very experienced, knowledgeable and nice.  He provided us good guidance and great service throughout our home mortgage process.  Highly recommend his services.",
            "Rating": 5,
            "Time": "12/02/2021 14:48:03"
        },
        {
            "author_title": "Sarbjit Singh",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJZnAt90eTYJ65J7ZWFx7iWh1AsjXoNr3LtVseO3drh5FQuqw=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "Kanwardeep Kanwar, The Name You can trust. He is good advisor and very helpful person.As a mortgage specialist he has a deep knowledge about any kind of mortgages and their rules, he helped me in my mortgage approval. 🙏",
            "Rating": 5,
            "Time": "11/29/2021 17:10:29"
        },
        {
            "author_title": "Bharath Raghavan",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLF27YyK0TI-4u8KBklT9G1VQiIBnvZE321QqDvPGzXJQrX=s120-c-rp-mo-br100",
            "author_reviews_count": 10,
            "Text": "Kanwardeep (also called KD) is the best in business! I am a first-time buyer, and KD went above and beyond, in getting the best interest rates for us, and also patiently explaining all the nuances involved. He is a pleasure to work with. I highly recommend him and will certainly refer him to my friends who are looking to buy a home! Thanks a ton Kanwardeep for everything and please keep up your good work!",
            "Rating": 5,
            "Time": "11/29/2021 15:50:56"
        },
        {
            "author_title": "Saswati Soumya Sahoo",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJJQlQ9ObbaKGv28pL0aET8tMPEnLcDpMKMiwxWjjjW7m1JiOY=s120-c-rp-mo-br100",
            "author_reviews_count": 6,
            "Text": "A very patient and knowledgeable person about mortgage market. He is always very proactive and helpful and just a call away for any queries. We got the best rate of interest by him.",
            "Rating": 5,
            "Time": "11/15/2021 22:35:57"
        },
        {
            "author_title": "Nicholas Fernandes",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWDC4Jsyu4n3pSnt2-HNrvq_7vRECh9ghggGk7QB4ku66hdLROl=s120-c-rp-mo-br100",
            "author_reviews_count": 16,
            "Text": "Kanwardeep is very professional and efficient in his work. Our mortgage was approved without any hassles. Highly recommended.",
            "Rating": 5,
            "Time": "11/13/2021 19:49:08"
        },
        {
            "author_title": "Pavneet Kaur",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXeXBP7iHtuPMblKSsA1ND9s7w-GtCpv0GEIIlfIIizw4OmRhap=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Mr. Kanwar was wonderful to deal with. His expertise, professionalism and above all his patience in going over details and explaining everything was commendable. He responds in a timely fashion be it emails or phone calls. I would highly recommend his services.",
            "Rating": 5,
            "Time": "11/11/2021 22:09:11"
        },
        {
            "author_title": "Pearl Fernandes",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocK0ImALe6cE_4Ke1eVkJOXm0A5TRHU_4JlA5JW1KNq3tERx-ak=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "KD is an Amazing Mortgage Specialist full of knowledge and lots of options. Our mortgage process was so easy with no headaches of running here or there. He also advised us about other investments.\nThank you Kanwardeep! You are doing great job by making people's DREAM COME TRUE..\nI highly recommend KD!",
            "Rating": 5,
            "Time": "11/10/2021 18:10:38"
        },
        {
            "author_title": "Mayank Garg",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjV4PoUOayUhsvCj-YXyvO9o4hYnXWzXwlfvLm5GwqFogQdO3Rcg=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "One of the best experiences in entire process. KD is very knowledgeable and efficient in providing all updates. Knows the process in and out and would highly recommend him.",
            "Rating": 5,
            "Time": "11/04/2021 11:12:23"
        },
        {
            "author_title": "Aham C",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKmo0C5G9jU6y_ESXYE7JdFbST4b8COEuGE168Qn89b-OT1v4w=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Kanwardeep Kanwar is a really helpful and knowledgable person I have seen sofar in mortgage financing. He has not only given us great mortgage rate and cashback but also guided us with very valuable suggestions at that time. As a first time home buyer we are really thankful to him for all of his help guidance and suggestions. In addition to that ,he gave us detailed explanation to our questions. Our phone calls were quickly responded too as well as great advice regarding our mortgage was given. We have recommended Kanwardeep to many of our family members and friends as he is one of the best mortgage advisor.",
            "Rating": 5,
            "Time": "10/26/2021 21:10:44"
        },
        {
            "author_title": "vishal patel",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKoJL5UecIK8ocOCnVhvxWMhmxME7oknVcXTCmcJmDhFs1fEA=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "Kanwardeep Kanwar is a really helpful person, he gave us a great morgage rate. Also, he gave us detailed explanation to our questions. Our phone calls were quickly responded too as well as great advice regarding our mortgage was given. We have recommended Kanwardeep to many of our family members as he is one of the best morgage advisors.",
            "Rating": 5,
            "Time": "10/25/2021 01:39:41"
        },
        {
            "author_title": "zunaid jogiat",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKV9aA4ahPXFSqPUMzmkl5FF8743fvcPOMTE_W8P5vxPmkPzw=s120-c-rp-mo-br100",
            "author_reviews_count": 8,
            "Text": "KD is very professional mortgage agent. I Really appreciate his service. He has done my mortgage with very good interest rate. I recommend him for mortgage servicers.",
            "Rating": 5,
            "Time": "10/16/2021 02:46:42"
        },
        {
            "author_title": "Sai Edupuganti",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXrLpHzti574XjSSeZdLUnLHeL5pw0ky8JN0C8n5mRJC0j7pzd2EA=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 14,
            "Text": "KD has been very patient throughout the process of our Mortgage file. Although we reached out to him in the last phase, he worked nonstop to make it happen before even a few days left for the final closing date which gave us so much peace of mind as we avoided last minute tensions. He is very responsive, professional and helpful in securing a mortgage for our new home. He’s kept his word and promises made to us, and we really appreciate it. Highly recommend KD!",
            "Rating": 5,
            "Time": "10/10/2021 19:12:51"
        },
        {
            "author_title": "saurin patel",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXxLkUTO1H_ummYS5j09j_NWIvzRU0myXFOkybPbiF0cbALG9gW=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "I chose to deal with KD when purchasing my second home after meeting with a few different mortgage brokerages. He was awesome to deal with. He got us great rate and did everything he could to make the transition go as smoothly as possible. The transaction was months before my closing date. I am very happy with the service he provided.",
            "Rating": 5,
            "Time": "10/05/2021 23:36:11"
        },
        {
            "author_title": "nailesh ratilal",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocL0W6cLd9nPoKW650Vez_waMy1g-olIysdfiloe6uVsNV4BuA=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "Mr. Kanwardeep is very knowledgeable mortgage agent.  he does work very precisely and accurately. if its required he go extra mile to complete his work on time. He is sincere, has patience . I surely suggest him for anyone who need mortgage .\nThank you Mr. Kanwardeep for my mortgage done on time.",
            "Rating": 5,
            "Time": "10/05/2021 15:51:24"
        },
        {
            "author_title": "Krushna Patra",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjW88CzcYjjcGVcYpy41vlm04uxFs4xEbsxX-J7i2NcM8eQBaq8uDw=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 21,
            "Text": "Mr. KD has great understanding of the Mortgage products.\n\nI like the fact that, he understands your need and then he explains you what is best for your need.\n\nHe is been able to give great service to his clients.\n\nI highly recommend to get in touch with him if you need any help in mortgage.",
            "Rating": 5,
            "Time": "10/04/2021 02:14:01"
        },
        {
            "author_title": "natacha jamshidi",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWrdTY4hBFZilupowYjldidKDRT1V92vb_qQP4Dtte-XWF3QIsd=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "My husband and I needed money for a major home reno. We enlisted the expertise of Mr. Kanwar to get a home equity line of credit. Mr. Kanwar was on time, professional and knowledgeable in assisting us in every step\nof the application. He kept us in the loop with regular phone calls and even went out of his way to meet with us on his day off. We recommend him to anyone who needs a line of credit or a mortgage.",
            "Rating": 5,
            "Time": "10/01/2021 14:12:40"
        },
        {
            "author_title": "Mythri Fintech",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKGxydKMrJqUNhbiCTO4wtXaQJYBEZT4yIX2QmnBs5iJYhUnw=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "KD is amazing person and follow professional ethics\nHe brings wealth off knowledge on BMO Mortgage Products . He is specialized in rental properties approval and corporation  residential deals.\nWe expanded our real estate portfolio with the help Of KD expertise.\n\n5 ⭐️BMO Mortgage Specialist 💫🎖",
            "Rating": 5,
            "Time": "09/14/2021 10:34:13"
        },
        {
            "author_title": "Bedabrata Bhattacharjee",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXVuhBHeWpnTx5-M6IDmguP4BXQ5yDXttoPBuC_cRl2ngiw758=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "KD has been spectacular guiding us through every step of the mortgage approval process. He made sure we had a pleasant and seamless end to end experience by making himself available late nights or weekends whenever we needed him. He provided us the best competitive rates available. I would highly recommend KD to anyone looking to secure a best in market mortgage from an A Lender Bank (BMO).",
            "Rating": 5,
            "Time": "09/09/2021 03:20:38"
        },
        {
            "author_title": "Sagar Jani",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjX5EJHITkmA45Qw_DY7aFOgAQnyNnRwDWhSkgEhESYaG82uH5z-UQ=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 24,
            "Text": "The Go To person for your next mortgage advice.\n\nWe were based in Calgary and KD has been helpful in understanding our situation and making us understanding the process and it's steps.\n\nStraight forward, honest opinions. 100% Service satisfaction\n\nJust give me a call anytime and he would be up to help you.",
            "Rating": 5,
            "Time": "09/01/2021 19:10:11"
        },
        {
            "author_title": "sukhmani singh",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIgzal2L1YaxVmMkF_IsPIPX5BgEfsYNiHPPDc5pB8tOrtCfdY=s120-c-rp-mo-br100",
            "author_reviews_count": 7,
            "Text": "Kanwardeep is the best mortgage advisor that I have ever met. He is extremely knowledgeable about the market and explains everything in simple terms. He is patient, soft spoken, and actually cares for his client’s needs. It is a breath of fresh air to work with someone who knows what he is doing and is doing it so well. It is a rarity to work with a consummate professional like Kanwardeep in today’s day and age. I would recommend him to anyone in a heartbeat.",
            "Rating": 5,
            "Time": "08/23/2021 04:15:10"
        },
        {
            "author_title": "devraj subedi",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVwBVywPwQzhFz7wfSNDFqRf25iLbwOM7mRkS6lkzkxyOa783sp=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Best mortgage advisor . Please make sure you call kanwardeep for any kind of mortgage advice. I got the lowest rate. I was with Rbc for 6 years but he beat the price when it comes to rate of interest.\nStrongly recommended",
            "Rating": 5,
            "Time": "08/16/2021 15:12:26"
        },
        {
            "author_title": "Kumud Awasthi",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWaL4sxR8M68OVc_3C4PFGNt6HUKH91KxD08qoyvRBoVAqi-mxH=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Kanwar has been very professional and knowledgeable and he provides all the good options and explains all the details about products which helps to pick the right product for the customer . Thanks Kanwar ji for your support .",
            "Rating": 5,
            "Time": "08/08/2021 23:49:12"
        },
        {
            "author_title": "Manisha Gautam",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVvs0MVae10Tb7eeAxvC-CbuHrnzbtAXVKdtE4I57va3nkW8oWF=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Kanwar has been amazing! Very responsive, professional and helpful in securing a mortgage for our new home.  He’s kept his word and promises made to us, and we really appreciate it. Highly recommend!",
            "Rating": 5,
            "Time": "08/06/2021 14:24:13"
        },
        {
            "author_title": "Anand Sachdev",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUoCpd4yNYA69u80rUE07R1sL4TxilZN_gt55jWSGrUx50a0-b4=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 12,
            "Text": "I find myself lucky to have connected with Kanwardeep for my home buying mortgage needs. He comes with excellent expertise and offers for your mortgage needs. He's a good listener and provides you with best possible solutions and answers all your queries very patiently. Above all, he's trustworthy, ever approachable and the most reliable person for your mortgage needs.",
            "Rating": 5,
            "Time": "08/05/2021 03:41:28"
        },
        {
            "author_title": "JULIES VARGHESE P",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWJGNTuuP--rk1xkTjtK5oiegadNbRTC-dxde6flnc48xUb9mK_nQ=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "Better than the best! 100% satisfied with the service and the end result. I visited at least 4 other Banks for my mortgage with lots of references. No one else offered the rate which I received from Mr. Kanwar through BMO.\nThe best part of my experience is the clarity and confidence he had in the entire conversation. Last but not least he will deliver what he promises.\nI recommend him with full confidence.\nOnce again thank you for your wonderful service.\nJulies P.",
            "Rating": 5,
            "Time": "08/05/2021 01:26:14"
        },
        {
            "author_title": "Devinder Babbra",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjW3e59Z-3NiTZpsr5hXGgr3DpJkEMmNYMIDAD783IWn7LsbmdyM=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "Best service in the town. Kanwar is very promising, very knowledgeable and highly professional person. He always picks the phone and answer all of my questions truthfully. I strongly recommend his name. Thank you Kanwar for all your cooperation in the past. Keep it up!!!!!",
            "Rating": 5,
            "Time": "08/02/2021 13:00:44"
        },
        {
            "author_title": "ravinder singh",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjV_FGM-pk7GEPN6_BcHd9q6Ayvrv3XZJwHui3iJRgi4sCM_eWsQ=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "Kanwardeep is the best mortgage advisor.He always concentrates on the financial situation and suggests accordingly.",
            "Rating": 5,
            "Time": "07/31/2021 19:26:09"
        },
        {
            "author_title": "Hansaben Patel",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocL2oQv9HcjbU0WMigbtV2VOQxhd80UXt71g2xw9k4oK5Y1lHA=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "KANWARDEEP is  the best mortgage broker, best service, perfect knowledge, advice, speedy approval in mortgage, any time available, replied in polite manner.",
            "Rating": 5,
            "Time": "07/28/2021 02:44:15"
        },
        {
            "author_title": "Maruthi Gonuguntla",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjW-tUM0HbGb4Oblz-7z8nUstLTFUnMTqmEAABfkeHIfJaWDruuB=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "I highly recommend Kanwar, he is always reachable and ready to help and make the things so easy, without a second thought I suggest please connect with Kanwar for your mortgages",
            "Rating": 5,
            "Time": "07/28/2021 00:15:14"
        },
        {
            "author_title": "vishal sharma",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWwyAJbV_1t0532FEQ1V8F7tRGldo86usRhgX4cyPUw1t5sP6pc=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Nice and detailed Mortgage agent with solutions to almost every mortgage scenario. Highly recommend his services",
            "Rating": 5,
            "Time": "07/16/2021 19:19:25"
        },
        {
            "author_title": "PIYUSH Sharma",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLVdQFnrsfibS_-Axz0bmvrsMuaKz0PNIeGLAuiHyfVAOuMQQ=s120-c-rp-mo-br100",
            "author_reviews_count": 6,
            "Text": "He is the best mortgage specialist and my experience with him has been an amazing from start of my mortgage application. He is very professional, knowledgeable and soft spoken. Thank you so much for making it a seamles experience. Looking forward to happily refer my friends and family to you :).",
            "Rating": 5,
            "Time": "07/01/2021 16:34:16"
        },
        {
            "author_title": "Nida",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjViD_EFmQbHULMpFY9htcLEGZ11Taq6tkl-lmiu-HS3oceIm3UI=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 25,
            "Text": "Found KD great to work with. Really knowledgeable and highly recommend him to anyone who's looking for mortgages!",
            "Rating": 5,
            "Time": "06/29/2021 03:44:01"
        },
        {
            "author_title": "Fahad Khan",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVUrh0vrNbDGKyPnb-2ZKGVKCkBVuPF1cNmNeMK-sD2OiAwVhzs=s120-c-rp-mo-ba4-br100",
            "author_reviews_count": 26,
            "Text": "I highly recommend Kanwardeep (KD) Kanwar for your mortgage/lending needs. I found him friendly yet professional, extremely knowledgeable and patient. He was able to get my approval and really fights for you to get the best deal. Definitely became a long term customer of KD and have already recommended him to others. Don't hesitate, call him!!!",
            "Rating": 5,
            "Time": "06/29/2021 03:31:49"
        },
        {
            "author_title": "Jenil Kothari",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVxSkYhETHO_wF_GfDDiCsJ3g0-ubZ5JJ2DlYAptDig_hkkjAw=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Mr. KD is one of the best mortgage advisor I have come through. He understand your needs and gives you an honest opinion and makes sure your dream of getting a mortgage approved is met. He is very transparent and explains you everything and the process. I highly recommend KD for your mortgage needs.",
            "Rating": 5,
            "Time": "06/27/2021 16:14:59"
        },
        {
            "author_title": "Rahul Dutta",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUexUKp6S30ayLF302C65d0p4TkEKWrTaEbMNduPr1k8T7XdPaT=s120-c-rp-mo-br100",
            "author_reviews_count": 10,
            "Text": "I find my fortunate to find KD as my mortgage specialist.  I must appreciate his response time to my queries and his quickness to deal with the issues.  If you want best services with regards to your mortgage, I 200% recommend KD.",
            "Rating": 5,
            "Time": "06/23/2021 16:13:29"
        },
        {
            "author_title": "dhairya sheth",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLts2oFxS4GK9ZfvX2UaQH5gYey-ZKclnvXGFGBClzT1VHUeQ=s120-c-rp-mo-br100",
            "author_reviews_count": 9,
            "Text": "KD is very knowledgeable Mortgage specialist.  He is very professional and polite. He will clear all the doubts regarding the mortgage . I will definitely refer all friends and family to Kanwar moving forward.",
            "Rating": 5,
            "Time": "06/23/2021 14:59:31"
        },
        {
            "author_title": "Arun Mathew",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjV9zYACyp7Xw6ld42REhHqb3huNLLb-4bxNQKGPCczTnf2G_9An=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "He is an excellent mortgage specialist with friendly and helpful mind. Good knowledge about the market and always trying to maintain good relationships. Definitely I recommend his service for mortgage.",
            "Rating": 5,
            "Time": "06/20/2021 16:42:42"
        },
        {
            "author_title": "Desai Family",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIjeEqztAQTmpjmYUenT1WvaDH9VvVzNyQD9VUvXeHIgzCeXA=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "I completely agree with other reviewers that Mr. KD is very knowledgeable,  provides exceptional & professional customer service! He is very soft spoken, calm, patient & understands customer's requirements. He provided me with good mortgage rates & kept me well informed & timely throughout the entire process! Obtaining mortgage from him was a very smooth,  hassle free & content experience! I highly recommend Mr. KD to anyone looking for a mortgage! Thank you Mr. KD! I greatly appreciate your assistance!",
            "Rating": 5,
            "Time": "06/14/2021 23:13:47"
        },
        {
            "author_title": "karthik raghu",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjWvJ1psxAHskjDCzUi81QsaNHs0Okb74946UZ6I55p3FLxFf9lh=s120-c-rp-mo-br100",
            "author_reviews_count": 7,
            "Text": "Mr Kanwar is excellent  guy with lots  off knowledge and experience.",
            "Rating": 5,
            "Time": "06/13/2021 20:16:44"
        },
        {
            "author_title": "Sean Maharaj",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJoRprsUlcI2L9PKjGoO4iETckyblidoPaN4llZapbasQ-HiA=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Kanwar really helped me to a get a mortgage and he was very understanding.  He is a calm guy and was easy for me to work with him.  I recommend Kanwar to anyone who is trying to get a mortgage because he is very experienced and easy to talk to. Thanks again Kanwar!",
            "Rating": 5,
            "Time": "06/08/2021 16:33:32"
        },
        {
            "author_title": "Nitin Luthra",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKZkvAtQEBBNHMeNRgFs6bIGdTN_gR02IS2JOMK-jV4FQWzMQ=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "KD is an excellent Mortgage specialist with exceptional knowledge of the mortgage market and products available. My experience with him have been always amazing. One thing, I admire that he doesn't give false hopes. He is so polite and professional. I highly recommend your services to all my friends and family as you are excellent mortgage specialist and one of good human being I’ve ever met.\n\nThank you again for all your help and guidance.",
            "Rating": 5,
            "Time": "06/05/2021 17:37:06"
        },
        {
            "author_title": "Parvir Mahil",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocIYZLxxxZeFmD7xdI-I6h37Wd3DkreNGBcD8mGmnrzSCRJYWPGe=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 42,
            "Text": "Kanwar gives a great sense of comfort when working with him. He is very professional and educated in his field. He made our first mortgage experience a breaze and the second one was even easier. Great service and I highly recommend him to anyone looking for help in getting a mortgage.\n\nThank you once again KD!!",
            "Rating": 5,
            "Time": "06/03/2021 18:42:24"
        },
        {
            "author_title": "Prakash Timalsina",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJnbs0TsdMucRHk23_PyFm7tlhalcdJXUvcXXI6h4NT8c8jnw=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "Mr KD kanwar is amazing well professional and result oriented person referred to me by my senior colleague. We’re first time buyers and he guided us through the process and explained everything in detail giving us great tips from start to finish. He listened  and gave valuable suggestions to our concerns and was very open and honest. My highest recommendation to use Mr KD for his great professional services! He wont disappoint you! Thank you!",
            "Rating": 5,
            "Time": "06/03/2021 15:54:26"
        },
        {
            "author_title": "Neha Chaudhari",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjW_p-DRwzphDOBmcKAa7RI0NNV_hsgs_lV-Ju03xJei2RzAad36=s120-c-rp-mo-br100",
            "author_reviews_count": 7,
            "Text": "We had a really good experience working with KD. He not only gave us good rate but also ensured that the process is smooth and hassle-free. He is very approachable and provides excellent customer-service. Thanks for helping us.",
            "Rating": 5,
            "Time": "06/03/2021 14:40:28"
        },
        {
            "author_title": "Parthiv Patel",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJ_Iz7-XkPwN3-X-cC-aMiTGCpg5YVDEkniC-VJs4lhrqVFlM-g=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "To those who are interested in working with Kanwardeep, I must express my complete satisfaction with his work. In addition to aiding me with the selection of my mortgage plan, Kanwardeep went above and beyond by helping me get approved for fast track services, therefore allowing me to meet my necessary deadline. This was not something that I had asked him to do, and yet he did it to help me as much as possible. It is evident that Kanwardeep will reach out and aid his clients in every conceivable way, something that I have rarely seen with other specialists. For these reasons as well as his great interpersonal skills, I strongly recommend him to anyone in the future.",
            "Rating": 5,
            "Time": "05/29/2021 22:39:06"
        },
        {
            "author_title": "Sachin Rathi",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocICgeqCgGxeaLlr35Z1apdtuDso5pb51wckY-YsWKZFBUyGQw=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 18,
            "Text": "Kanwardeep is an excellent Mortgage specialist with exceptional knowledge of the mortgage market,my experience with you have always been amazing and I continue to get impressed with your professionalism, responsiveness yet very polite nature every time I bring forth a new deal even when I say that’s it we found our dream home lol.  I must say you are an amazing person. You considered our situation and made it your personal mission to make our dreams come true over and over again. You are so polite, caring and charismatic which made our experience so pleasant during such a stressful time. You took on our stress away and made sure that everything is aligned and for that I am sincerely grateful. The best part is the entire process didn’t feel like another typical transaction. I highly recommend your services to all my friends and family as you are the best mortgage specialist I’ve ever met.\n\nThank you again for all your help and guidance and for always looking after us.\n\nI would highly highly recommend Kanwar!!!",
            "Rating": 5,
            "Time": "05/26/2021 12:40:15"
        },
        {
            "author_title": "Vivek Balakrishnan",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjXw0UoCouW210PM5eExeNO-NSCR7I9V90B8SkINv6y3TrKHYnSI=s120-c-rp-mo-ba3-br100",
            "author_reviews_count": 41,
            "Text": "My experience with Kanwardeep (KD) was amazing from start of my mortgage application till finish. He is professional, soft spoken and works above and beyond to meet your expectations. I recommend his service to get the best mortgage deals!!",
            "Rating": 5,
            "Time": "05/25/2021 14:58:44"
        },
        {
            "author_title": "Nav C",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLJxKiKlljzQ2vEby53dx9zTazXREFBSYZlHyJEwOXt9xhVRQ=s120-c-rp-mo-br100",
            "author_reviews_count": 6,
            "Rating": 5,
            "Time": "05/19/2021 22:49:00"
        },
        {
            "author_title": "Amit Sikder",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVQP53Wfoeq9Inxozjll3ut58BqGNp5ONB7NKzJM61oJBc2iYw8=s120-c-rp-mo-br100",
            "author_reviews_count": 5,
            "Text": "Mr. Kanwar provides very professional and knowledgeable service. Highly recommend him to anybody looking to get the best rates for mortgage. Thank you!",
            "Rating": 5,
            "Time": "05/19/2021 01:02:52"
        },
        {
            "author_title": "Pranav Chauhan",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJcHcMS8IevzaRxH7_CLMxtUOOGdF_AepuRnbo8Aa8Bn3t0lA0=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Kanwardeep is very nice person, super friendly and helpful.  He goes extra mile to help by putting client's interest first with honest advice.  Definitely recommend his service to get best mortgage options!",
            "Rating": 5,
            "Time": "05/17/2021 20:54:33"
        },
        {
            "author_title": "suketu patel",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjUVlKvL-KI9zTOoH1Du1k-8XeT0Jz3U77vy1Dxq0FyJc17OozI=s120-c-rp-mo-br100",
            "author_reviews_count": 8,
            "Text": "We had Amazing experience working with KD, he helped us out to get a mortgage for a property. He is very knowledgeable and experienced at his work. He provided us a lot of guidance throughout the entire process. I have also referred his name to my family members and friends. They also got the mortgage from KD and they are very happy with his work and his attention to all the details. I would really recommend anyone looking for a mortgage to give KD a call. 😊",
            "Rating": 5,
            "Time": "05/17/2021 11:53:46"
        },
        {
            "author_title": "jaideep batta",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJ_D69ZaiM6d9HNHZwDnmhz0mSwjoHtSH4Pp9iS-6LdV6H-bw=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Great service offered by Kanwar. Thanks Kanwar",
            "Rating": 5,
            "Time": "04/20/2021 21:29:01"
        },
        {
            "author_title": "Rajnish Garg",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjX0uDPvVAYMprGSDWdcw97DWL34zBNvhsihlRNRpWd6CFtlp9R3=s120-c-rp-mo-br100",
            "author_reviews_count": 20,
            "Text": "Kanwar sir is a gem of a person. My experience with them have been an amazing from start of my mortgage application till finish. He is very professional, soft spoken, understands the needs and reviews each detail in a detailed manner. He is very trust worthy gentleman. Thank you so much for making it a seamless experience sir. Looking forward to happily refer all my real estate clients to you 😊😊",
            "Rating": 5,
            "Time": "04/15/2021 23:38:16"
        },
        {
            "author_title": "David Rajaratnam",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocILsqHl0QXon7wXU-heXZwSeZSFWErH-nWGMpY9KWkxX3f33Q=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "I was introduced to Kanwardeep (better known as KD), through my friend and had the privilege of meeting and working with him for the renewal/refinancing of my home, in January 2021. Though I had met and spoken to quite a few different bank agents by then and was quite stressed by the whole process and undecided in my decision making, my meeting with KD was unlike any other. With his quiet and gentle demeanour, KD has a calming effect on his clients. He was very understanding and assuring at every step and went out his way, to make our experience a great one. He always answered our phone calls on the first ring and was never tired of repeating himself and asking us to rest assured that he would get us the best rate. He did an outstanding job to get us an incredible rate of 1.7% for a 5 year fixed term, even as the rates started climbing.\nI would highly recommend KD to all those that are looking to refinancing/renewing their mortgages or even first time home buyers. Besides being a mortgage agent/specialist, KD is also a financial and investments advisor and more and can be a great help in every way, to be acquainted with. Wish you all the best!",
            "Rating": 5,
            "Time": "03/29/2021 13:02:56"
        },
        {
            "author_title": "syed shah",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjW2l6OYL7ueJbUtgOoFc55ALnkiOuJ8GyXFXqTLG2FWTwARFRw=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "I have experienced the best service, while applying for mortgages you need someone who is always available and answer your call and give you all the information in timely manner, KD was available vey humble and knowledgeable person, Thank you for all your help.",
            "Rating": 5,
            "Time": "03/07/2021 03:59:36"
        },
        {
            "author_title": "vijayan subramaniyan",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVVC7gQbJe5zQB2SBnG74-8slowNCUA_jzqZikaxiKpWCP9Pb_f2w=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "I am really glad that I was able to meet a sensible and reliable mortgage professional in Canada for the first time who wouldn't shy away from phone calls and a very calm individual who helped to us to get the mortgage within a tight timeline. He also advised us on the merits and de-merits between Variable and Fixed rate mortgage. I would highly recommend his service for anyone looking for home mortgage.",
            "Rating": 5,
            "Time": "03/03/2021 17:46:25"
        },
        {
            "author_title": "Soumyadeep Basu",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKOSRY41BKiqDRPbQshg3ISXADuRjSdA47EkKCZB_qZgzhfOA=s120-c-rp-mo-br100",
            "author_reviews_count": 8,
            "Text": "Mr. Kanwardeep Kanwar helped me and my family for refinancing my house mortage. The amount after refinancing significantly reduced my mortgage amount per month. An extremely dedicated, dynamic and transparent professional. Kudos to KD Saheb and all the best for future endeavors. Would recommend everyone who would like to apply for house mortgage, to consult with KD Saheb and get the best out from him.\nThanks a lot Sir..!!",
            "Rating": 5,
            "Time": "02/18/2021 17:33:10"
        },
        {
            "author_title": "Dharanitharan Palaniyappan",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVnDe__MTfW75R2YJ5cOFh_jU6Nzm_LJxWBUKPTo7kIsfnHF1lQ=s120-c-rp-mo-br100",
            "author_reviews_count": 7,
            "Text": "I am happy to say that I got the contact of Kanwardeep. When many mortgage specialists couldn't get me approval, he committed that he will get the mortgage approval and got the best deal. He also educated me on maintaining good credit score. I highly recommend him for anyone who is hunting for housing loans.",
            "Rating": 5,
            "Time": "01/21/2021 13:46:22"
        },
        {
            "author_title": "Hitesh Varma",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocJ6NzWjhfytJeAz07gdCvME0gOGE1C27zIAai97uIOg9gHrdQ=s120-c-rp-mo-br100",
            "author_reviews_count": 2,
            "Text": "Very helpful throughout the entire process of obtaining mortgage. Always ready to answer any questions I have, even after the deal has been put through. Overall, it was a great experience working with Kanwardeep.",
            "Rating": 5,
            "Time": "01/16/2021 21:28:19"
        },
        {
            "author_title": "Manjinder D",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVzmTYByaTXF_2fkSYGFndkm7ocqxrDEKG1SiAdGT_y-oR7nk0=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 16,
            "Text": "Kanwardeep Kanwar is a outstanding Mortgage Specialist, we highly recommend him. There’s no denying, getting a mortgage is stressful but he made the process as stress-free as possible. His communication is excellent, with quick phone, email and text responses. His knowledge about current mortgage rules and programs he knows what he is doing. We really felt he cared about our situation and investing time in getting us the mortgage we needed.\nOverall, absolutely impeccable, faultless service.",
            "Rating": 5,
            "Time": "01/14/2021 22:18:25"
        },
        {
            "author_title": "Gagandeep Singh",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLfiaZ8om7-zOl7v5JtQs8Oz2ozzTfMtK23CIFgafnmra0yJQ=s120-c-rp-mo-br100",
            "author_reviews_count": 12,
            "Text": "KD's services are highly recommended. His ever ready support and replies to queries in a calm manner is much appreciated.",
            "Rating": 5,
            "Time": "11/27/2020 00:38:18"
        },
        {
            "author_title": "Ankit Khatri",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVuAZIhD8ZWuxgdiw80p89n5Iq2pIuaHVxvRnSCMY6HIfwaE1Q=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "I had a very pleasant experience with Mr. Kanwar. He was honest right from the start and did not mislead. I would recommend him to anyone who is looking for a mortgage. He will get the job done and most importantly he will do it on time without any issues.",
            "Rating": 5,
            "Time": "11/06/2020 04:07:31"
        },
        {
            "author_title": "Tarun Kumar",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKwuOYXc_-kjruWR7Arq3DuIHZm5laedFPwpcCvMLORkJNl94g=s120-c-rp-mo-br100",
            "author_reviews_count": 1,
            "Text": "Awesome is the word I will describe. Very positive attitude and advise best in the interest of the customer. Never promised anything wrong or rather saying anything that is not possible (like other mortgage broker)\n\nWould recommend him for smoother and trustworthy experience.",
            "Rating": 5,
            "Time": "10/28/2020 21:09:25"
        },
        {
            "author_title": "Pushpa Acharya",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocI2xHKligV9DZAi-NyX_P90xY9Cy1q3d5fapProoYqAslz4PMFV=s120-c-rp-mo-br100",
            "author_reviews_count": 3,
            "Text": "Kanwar has a very positive attitude and excellent knowledge in what he does. He helped me with my line of credit and I definitely  recommend  him if you need any financial advice on loans, mortgage, line of credit and refinancing.",
            "Rating": 5,
            "Time": "08/23/2020 16:52:49"
        },
        {
            "author_title": "Hamza Khan",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocKg-uKYjdHsr_WkRnupEhuzl2uaClZgNBGePCmPYile4MwoWg=s120-c-rp-mo-br100",
            "author_reviews_count": 10,
            "Text": "Kanwar was excellent!! Very responsive, efficient and provides great advise. He genuinely cares for the client and is looking for their needs above anything else. If you are looking to purchase or re-finance a home, I would highly highly recommend Kanwar!!! He gets the job done.",
            "Rating": 5,
            "Time": "02/13/2020 16:27:13"
        },
        {
            "author_title": "Sana",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocI8RVUWx3fk5A0yXOf0rGNgR31Ah1b0mpZ06YXGvz2iqz3ELA=s120-c-rp-mo-ba2-br100",
            "author_reviews_count": 18,
            "Text": "Kanwar provides excellent service! He was quick to reply to all my questions and helped me thoroughly understand the mortgage process as this was my first time. I would recommend his services to everyone, thanks KD!",
            "Rating": 5,
            "Time": "02/13/2020 16:05:54"
        },
        {
            "author_title": "Anurag Mishra",
            "author_image": "https://lh3.googleusercontent.com/a-/ALV-UjVWXA-Eby4bAczb1ZULa_5eBoWqW7L-42P3SiIwNqRRRDdWFt8=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "Anyone looking for a professional and quick mortgage service?? Please meet Mr. Kanwardeep Kanwar and get your mortgage done. My experience of getting my mortgage was superb!",
            "Rating": 5,
            "Time": "02/06/2020 21:05:16"
        },
        {
            "author_title": "Manoj Heryani",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLyYokdg2xsFOq9lIsnQMmWgpgRNFXs9-11TbknMc5rLTEUUg=s120-c-rp-mo-br100",
            "author_reviews_count": 13,
            "Text": "I havent met a very polite and a thorogh gentleman like KD. His work speaks for itself. He gives a sense of peace that work will be done and that is so helpful when specially you are busy in other stuff while buying a house. His follow up and service is par excellence. Hos personal touch is a magic. I would definitely recommend him always. Kudos to KD 🙏",
            "Rating": 5,
            "Time": "09/03/2019 18:42:19"
        },
        {
            "author_title": "Jeff Correia",
            "author_image": "https://lh3.googleusercontent.com/a/ACg8ocLNevXWFZ3ZnqY93oR9rOEau2Cy93SPRFO1L5qmBk_ZYlSIFQ=s120-c-rp-mo-br100",
            "author_reviews_count": 4,
            "Text": "I reached out to Kanwar last minute on a Saturday after bank hours as I was coming close to my closing date for my pre construction home and my previous broker had let me down. Working 9 to 5pm or longer daily I had no time to meet anyone during bank hours. Kanwar answered my request immediately and was able to meet me near my house at a coffee shop. He gave me lots of options as I was struggling and he got to work right away. He worked tirelessly with the bank and myself getting all the documents we needed to get our approval in time. I am so happy with the service and that we were able to secure my new home. I will definitely refer all friends and family to Kanwar moving forward. It is clear when you speak with him that he has many years of experience and many deals under his belt that similar to my experience and maybe yours too that he can offer insight.",
            "Rating": 5,
            "Time": "04/17/2019 16:04:18"
        }
    ]
}